// 6 задание, распечатать сведения 
// обо всех компьютерах серверах
// и рабочих станциях

#include <stdio.h>
#include <string.h>
#include "components.h"

int main(int argc, char *argv[])
{
	
	components p;
	FILE *file = NULL;
	
	if (argc < 3)
	{
		printf("Использование: %s файл флаг\nФлаги:\n-f - печать базы данных\n-p - выполнить задание\n", argv[0]);
		return 1;
	}

	file = fopen(argv[1], "rb");
	if (file == NULL)
	{
		printf("Произошла ошибка при открытии файла\n");
		return 1;
	}

	if (!strcmp(argv[2], "-f"))
		{
			printf("+-----------+----------------------+------------+--------------------+-----------------+-----------------------+---------------------------+------------------------+--------+\n");
			printf("|  Фамилия  |Число и тип процессора|V памяти(гб)|Тип видеоконтроллера|V видеопамяти(гб)|Тип(SCSI IDE, ATA Sata)|Число и емкость винчестеров|Кол-во интегр. устройств|   ОС   |\n");
			printf("+-----------+----------------------+------------+--------------------+-----------------+-----------------------+---------------------------+------------------------+--------+\n");

			while (fread(&p, sizeof(p), 1, file) == 1)
			{
				printf("|%11s|%10d%12d|%12d|%20s|%17d|%23s|%10d%17d|%24d|%8s|\n",
					p.name,
					p.cproc,
					p.tproc,
					p.memory,
					p.typev,
					p.vmemory,
					p.carrier,
					p.cquantity,
					p.capacity,
					p.devices,
					p.os
			);

			printf("+-----------+----------------------+------------+--------------------+-----------------+-----------------------+---------------------------+------------------------+------+\n");
		}
	}
	
	else if (!strcmp(argv[2], "-p"))
	{
		while (fread(&p, sizeof(p), 1, file) == 1)
		{
			int k = p.cproc;
			int m = p.memory;
			if (k > 1 || m > 32)
			{
				printf("Компьютер-сервер\n|%11s|%11d %13d|%12d|%20s|%17d|%23s|%10d %17d|%24d|%6s|\n",
					p.name,
					p.cproc,
					p.tproc,
					p.memory,
					p.typev,
					p.vmemory,
					p.carrier,
					p.cquantity,
					p.capacity,
					p.devices,
					p.os
					);
				printf("+-----------+----------------------+------------+--------------------+-----------------+-----------------------+---------------------------+------------------------+------+\n");
			}
			else 
			{
				printf("Рабочая_станция\n|%11s|%11d %13d|%12d|%20s|%17d|%23s|%10d %17d|%24d|%6s|\n",
					p.name,
					p.cproc,
					p.tproc,
					p.memory,
					p.typev,
					p.vmemory,
					p.carrier,
					p.cquantity,
					p.capacity,
					p.devices,
					p.os
					);
				printf("+-----------+----------------------+------------+--------------------+-----------------+-----------------------+---------------------------+------------------------+------+\n");
			}	
		}
	}

	fclose(file);

	return 0;
}